gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	/* 手动地磁背景值 */
	for (unsigned char i = 0; i < 5; i++) {
		TCFG_SystemData.MagBackManualX[i] = TCFG_EEPROM_GetMagManualBack(i, TCFG_X_AXIS);
		TCFG_SystemData.MagBackManualY[i] = TCFG_EEPROM_GetMagManualBack(i, TCFG_Y_AXIS);
		TCFG_SystemData.MagBackManualZ[i] = TCFG_EEPROM_GetMagManualBack(i, TCFG_Z_AXIS);
		if (TCFG_SystemData.MagBackManualX[i] == 0) break;
		talgo_set_manual_back(i, TCFG_SystemData.MagBackManualX[i], TCFG_SystemData.MagBackManualY[i], TCFG_SystemData.MagBackManualZ[i]);
	}
	
	/* 地磁背景温度补偿值 */
	TCFG_SystemData.MagBackgroudTemp = TCFG_EEPROM_GetMagBackgroudTemp();
	Qmc5883lData.temp_back = TCFG_SystemData.MagBackgroudTemp;
	
	/* 地磁温飘计算值 */
	TCFG_EEPROM_GetMagTempCoef(&TCFG_SystemData.MagCoefX, &TCFG_SystemData.MagCoefY, &TCFG_SystemData.MagCoefZ);
	Qmc5883lData.X_Coef = TCFG_SystemData.MagCoefX;
	Qmc5883lData.Y_Coef = TCFG_SystemData.MagCoefY;
	Qmc5883lData.Z_Coef = TCFG_SystemData.MagCoefZ;
	
	/* 获取设备工作模式 */
	TCFG_SystemData.WorkMode = TCFG_EEPROM_GetWorkMode();
	if ((TCFG_SystemData.WorkMode != DEBUG_WORK) && (TCFG_SystemData.WorkMode != NORMAL_WORK)) {
		TCFG_SystemData.WorkMode = NORMAL_WORK;
		TCFG_EEPROM_SetWorkMode(TCFG_SystemData.WorkMode);
	}
	
	/* 无线通道选择 */
	TCFG_SystemData.RFChannel = TCFG_EEPROM_GetRfChannel();
	RF_CHANNEL1 = TCFG_SystemData.RFChannel;
	
	/* 无线心跳间隔 */
	TCFG_SystemData.Heartinterval = TCFG_EEPROM_GetHeartinterval();
	if ((TCFG_SystemData.Heartinterval > 120) || (TCFG_SystemData.Heartinterval < 1)) {
		TCFG_SystemData.Heartinterval = HEART_INTERVAL;
		TCFG_EEPROM_SetHeartinterval(TCFG_SystemData.Heartinterval);
	}
	
	/* 无线调试输出等级 */
	TCFG_SystemData.RFDprintLv = TCFG_EEPROM_GetRFDprintLv();
	if (TCFG_SystemData.RFDprintLv == 0) {
		TCFG_SystemData.RFDprintLv = RF_DPRINT_LV_TYPE;
		TCFG_EEPROM_SetRFDprintLv(TCFG_SystemData.RFDprintLv);
	}
	
	/* 地磁模式 */
	TCFG_SystemData.MagMode = TCFG_EEPROM_GetMagMode();
	
	/* 传感器模式 */
	TCFG_SystemData.SenseMode = TCFG_EEPROM_GetSenseMode();
	
	/* 雷达次数 */
	TCFG_SystemData.RadarCount = TCFG_EEPROM_GetRadarCount();
	
	/* 雷达检测范围 */
	TCFG_SystemData.RadarRange = TCFG_EEPROM_GetRadarRange();
	
	/* 车辆进入延时上报时间 */
	TCFG_SystemData.CarInDelay = TCFG_EEPROM_GetCarInDelay();
	
	/* 车位检测车辆次数 */
	TCFG_SystemData.SpotStatusCount = TCFG_EEPROM_GetStatusCount();
	InspectSpotStatus.SpotStatus[InspectSpotStatus.Rear].spot_count = TCFG_SystemData.SpotStatusCount;
	
	/* 设备重启次数 */
	TCFG_SystemData.DeviceBootCount = TCFG_EEPROM_GetDevBootCnt() + 1;
	TCFG_EEPROM_SetDevBootCnt(TCFG_SystemData.DeviceBootCount);
	
	/* NBIot心跳间隔 */
	TCFG_SystemData.NBIotHeart = TCFG_EEPROM_GetNbiotHeart();
	if ((TCFG_SystemData.NBIotHeart == 0) || (TCFG_SystemData.NBIotHeart > 48)) {
		TCFG_SystemData.NBIotHeart = NBIOT_HEART_DATA_TIMER;
		TCFG_EEPROM_SetNbiotHeart(TCFG_SystemData.NBIotHeart);
	}
	
	/* NBIot重启次数 */
	TCFG_SystemData.NBIotBootCount = TCFG_EEPROM_GetNbiotBootCnt();
	
	/* NBIot 发送数据包数 */
	TCFG_SystemData.NBIotSentCount = TCFG_EEPROM_GetNBIotSentCount();
	
	/* NBIot 接收数据包数 */
	TCFG_SystemData.NBIotRecvCount = TCFG_EEPROM_GetNBIotRecvCount();
	
	/* NBIot 一天发送数据包数 */
	TCFG_SystemData.NBIotSentCountDay = TCFG_EEPROM_GetNBIotSentCountDay();
	
	/* NBIot 一天限定数据包数 */
	if (TCFG_EEPROM_GetNBIotSentCountLimit() == 0) TCFG_EEPROM_SetNBIotSentCountLimit(NBIOT_SNEDCOUNTDAY_LIMIT_NUM);
	
	/* Coap间隔时间发送普通数据包用于接收下行数据 */
	TCFG_SystemData.CoapRATimeHour = TCFG_EEPROM_GetCoapRATimeHour();
	if (TCFG_SystemData.CoapRATimeHour == 0) {
		TCFG_SystemData.CoapRATimeHour = 2;
		TCFG_EEPROM_SetCoapRATimeHour(TCFG_SystemData.CoapRATimeHour);
	}
	
	/* Coap保持连接时间 */
	TCFG_SystemData.CoapConnectTime = TCFG_EEPROM_GetCoapConnectTime();
	NbiotClientHandler.CoapConnectTimeSec = TCFG_SystemData.CoapConnectTime;
	
	/* Coap休眠时间 */
	TCFG_SystemData.CoapIdleTime = TCFG_EEPROM_GetCoapIdleTime();
	NbiotClientHandler.CoapIdleTimeSec = TCFG_SystemData.CoapIdleTime;
	
	/* NB核心网地址 */
#if NETPROTOCAL == NETCOAP
	TCFG_SystemData.NBCoapCDPServer.ip.ip32 = TCFG_EEPROM_GetServerIP();
	TCFG_SystemData.NBCoapCDPServer.port = TCFG_EEPROM_GetServerPort();
	if ((TCFG_SystemData.NBCoapCDPServer.ip.ip32 == 0) && (TCFG_SystemData.NBCoapCDPServer.port == 0)) {
		TCFG_EEPROM_Write_CoAPCDPAddr();
	}
#endif
	
	/* MqttSN服务器地址 */
#if NETPROTOCAL == NETMQTTSN
	TCFG_SystemData.NBMqttSNServer.ip.ip32 = TCFG_EEPROM_GetMqttSNIP();
	TCFG_SystemData.NBMqttSNServer.port = TCFG_EEPROM_GetMqttSNPort();
	if ((TCFG_SystemData.NBMqttSNServer.ip.ip32 == 0) && (TCFG_SystemData.NBMqttSNServer.port == 0)) {
		TCFG_EEPROM_Write_MqttSNServerAddr();
	}
#endif
	
	/* CTWing服务器地址 */
#if NETPROTOCAL == NETCTWING
	TCFG_SystemData.CTWingCDPServer.ip.ip32 = TCFG_EEPROM_GetCTWingIP();
	TCFG_SystemData.CTWingCDPServer.port = TCFG_EEPROM_GetCTWingPort();
	if ((TCFG_SystemData.CTWingCDPServer.ip.ip32 == 0) && (TCFG_SystemData.CTWingCDPServer.port == 0)) {
		TCFG_EEPROM_Write_CTWingCDPAddr();
	}
#endif
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_WriteParameterData(void)
 @Description			TCFG_EEPROM_WriteParameterData				: 写入系统参数信息
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_WriteParameterData(void)
{
	TCFG_EEPROM_SetSoftwareMajor(TCFG_Utility_Get_Major_Softnumber());
	TCFG_EEPROM_SetSoftwareSub(TCFG_Utility_Get_Sub_Softnumber());
	
	/* 升级信号值限制下限 */
	TCFG_SystemData.UpgradeLimitRssi = NBCOAP_PCP_UPGRADE_LIMIT_RSSI;
	TCFG_EEPROM_SetUpgradeLimitRssi(TCFG_SystemData.UpgradeLimitRssi);
	
	/* 升级信号质量限制下限 */
	TCFG_SystemData.UpgradeLimitSnr = NBCOAP_PCP_UPGRADE_LIMIT_SNR;
	TCFG_EEPROM_SetUpgradeLimitSnr(TCFG_SystemData.UpgradeLimitSnr);
	
	/* NBIot心跳间隔 */
	TCFG_SystemData.NBIotHeart = NBIOT_HEART_DATA_TIMER;
	TCFG_EEPROM_SetNbiotHeart(TCFG_SystemData.NBIotHeart);
	
	/* NB核心网地址 */
#if NETPROTOCAL == NETCOAP
	TCFG_EEPROM_Write_CoAPCDPAddr();
#endif
	
	/* MqttSN服务器地址 */
#if NETPROTOCAL == NETMQTTSN
	TCFG_EEPROM_Write_MqttSNServerAddr();
#endif
	
	/* CTWing服务器地址 */
#if NETPROTOCAL == NETCTWING
	TCFG_EEPROM_Write_CTWingCDPAddr();
#endif
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetSoftwareMajor(unsigned char softwaremajor)
 @Description			TCFG_EEPROM_SetSoftwareMajor					: 保存softwaremajor软件版本号
 @Input				softwaremajor
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetSoftwareMajor(unsigned char softwaremajor)
{
	FLASH_EEPROM_WriteByte(TCFG_SOFTWARE_MAJOR_OFFSET, softwaremajor);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetSoftwareMajor(void)
 @Description			TCFG_EEPROM_GetSoftwareMajor					: 读取softwaremajor软件版本号
 @Input				void
 @Return				softwaremajor
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetSoftwareMajor(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_SOFTWARE_MAJOR_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetSoftwareSub(unsigned char softwaresub)
 @Description			TCFG_EEPROM_SetSoftwareSub					: 保存softwaresub软件版本号
 @Input				softwaresub
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetSoftwareSub(unsigned char softwaresub)
{
	FLASH_EEPROM_WriteByte(TCFG_SOFTWARE_SUB_OFFSET, softwaresub);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetSoftwareSub(void)
 @Description			TCFG_EEPROM_GetSoftwareSub					: 读取softwaresub软件版本号
 @Input				void
 @Return				softwaresub
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetSoftwareSub(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_SOFTWARE_SUB_OFFSET);
}

/**********************************************************************************************************
 @Function			bool TCFG_EEPROM_CheckNewSoftware(void)
 @Description			TCFG_EEPROM_CheckNewSoftware					: 检测新的软件版本号
 @Input				void
 @Return				bool
**********************************************************************************************************/
bool TCFG_EEPROM_CheckNewSoftware(void)
{
	if ((TCFG_EEPROM_GetSoftwareMajor() != TCFG_Utility_Get_Major_Softnumber()) || (TCFG_EEPROM_GetSoftwareSub() != TCFG_Utility_Get_Sub_Softnumber())) {
		return true;
	}
	else {
		return false;
	}
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetBootMode(char bootmode)
 @Description			TCFG_EEPROM_SetBootMode						: 保存Boot启动模式
 @Input				bootmode
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetBootMode(char bootmode)
{
	FLASH_EEPROM_WriteBuffer(TCFG_ENVFLAG_OFFSET, (unsigned char*)"TCLD", TCFG_ENVFLAG_LENGTH);
	FLASH_EEPROM_WriteByte(TCFG_ENV_BOOTMODE_OFFSET, bootmode);
}

/**********************************************************************************************************
 @Function			char TCFG_EEPROM_GetBootMode(void)
 @Description			TCFG_EEPROM_GetBootMode						: 读取Boot启动模式
 @Input				void
 @Return				bootmode
**********************************************************************************************************/
char TCFG_EEPROM_GetBootMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_ENV_BOOTMODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SaveConfigInformation(unsigned int subSN)
 @Description			TCFG_EEPROM_SaveConfigInformation				: 保存配置信息和SN
 @Input				subSN
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SaveConfigInformation(unsigned int subSN)
{
	FLASH_EEPROM_WriteBuffer(TCFG_HEADFLAG_OFFSET, (unsigned char*)"TCLD", TCFG_HEADFLAG_LENGTH);
	FLASH_EEPROM_WriteWord(TCFG_SN_OFFSET, subSN);
}

/**********************************************************************************************************
 @Function			bool TCFG_EEPROM_CheckHeadFlag(char flagtype)
 @Description			TCFG_EEPROM_CheckHeadFlag					: 检测保存信息标志位
 @Input				flagtype
 @Return				bool
**********************************************************************************************************/
bool TCFG_EEPROM_CheckHeadFlag(char flagtype)
{
	if (flagtype == TCFG_FLAGTYPE_GENERAL) {
		if ('T' != FLASH_EEPROM_ReadByte(TCFG_HEADFLAG_OFFSET)) {
			return false;
		}
		if ('C' != FLASH_EEPROM_ReadByte(TCFG_HEADFLAG_OFFSET + 1)) {
			return false;
		}
		if ('L' != FLASH_EEPROM_ReadByte(TCFG_HEADFLAG_OFFSET + 2)) {
			return false;
		}
		if ('D' != FLASH_EEPROM_ReadByte(TCFG_HEADFLAG_OFFSET + 3)) {
			return false;
		}
	}
	else if (flagtype == TCFG_FLAGTYPE_MAGAlGORITHM) {
		if ('T' != FLASH_EEPROM_ReadByte(TCFG_MAGFLAG_OFFSET)) {
			return false;
		}
	}
	else if (flagtype == TCFG_FLAGTYPE_SECU) {
		if ('T' != FLASH_EEPROM_ReadByte(TCFG_SECUFLAG_OFFSET)) {
			return false;
		}
	}
	
