gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	memset((void*)&TCFG_SystemData.NBCoapCDPServerIP, 0, sizeof(TCFG_SystemData.NBCoapCDPServerIP));
	sprintf((char *)TCFG_SystemData.NBCoapCDPServerIP, "%d.%d.%d.%d", 
	TCFG_SystemData.NBCoapCDPServer.ip.ip8[3], TCFG_SystemData.NBCoapCDPServer.ip.ip8[2], 
	TCFG_SystemData.NBCoapCDPServer.ip.ip8[1], TCFG_SystemData.NBCoapCDPServer.ip.ip8[0]);
	
	return (char *)TCFG_SystemData.NBCoapCDPServerIP;
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_ServerPort_String(void)
 @Description			TCFG_EEPROM_Get_ServerPort_String				: 读取ServerPort字符串
 @Input				void
 @Return				ServerPort_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_ServerPort_String(void)
{
	TCFG_SystemData.NBCoapCDPServer.port = TCFG_EEPROM_GetServerPort();
	
	memset((void*)&TCFG_SystemData.NBCoapCDPServerPort, 0, sizeof(TCFG_SystemData.NBCoapCDPServerPort));
	sprintf((char *)TCFG_SystemData.NBCoapCDPServerPort, "%d", TCFG_SystemData.NBCoapCDPServer.port);
	
	return (char *)TCFG_SystemData.NBCoapCDPServerPort;
}

#if NETPROTOCAL == NETCTWING
/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCTWingIP(unsigned int val)
 @Description			TCFG_EEPROM_SetCTWingIP						: 保存CTWingIP
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCTWingIP(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_CTWING_SERVER_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetCTWingIP(void)
 @Description			TCFG_EEPROM_GetCTWingIP						: 读取CTWingIP
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetCTWingIP(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_CTWING_SERVER_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCTWingPort(unsigned short val)
 @Description			TCFG_EEPROM_SetCTWingPort					: 保存CTWingPort
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCTWingPort(unsigned short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_CTWING_SERVER_OFFSET + 4, val);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_EEPROM_GetCTWingPort(void)
 @Description			TCFG_EEPROM_GetCTWingPort					: 读取CTWingPort
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned short TCFG_EEPROM_GetCTWingPort(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_CTWING_SERVER_OFFSET + 4);
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_CTWingIP_String(void)
 @Description			TCFG_EEPROM_Get_CTWingIP_String				: 读取CTWingIP字符串
 @Input				void
 @Return				CTWingIP_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_CTWingIP_String(void)
{
	TCFG_SystemData.CTWingCDPServer.ip.ip32 = TCFG_EEPROM_GetCTWingIP();
	
	memset((void*)&TCFG_SystemData.CTWingCDPServerIP, 0, sizeof(TCFG_SystemData.CTWingCDPServerIP));
	sprintf((char *)TCFG_SystemData.CTWingCDPServerIP, "%d.%d.%d.%d", 
	TCFG_SystemData.CTWingCDPServer.ip.ip8[3], TCFG_SystemData.CTWingCDPServer.ip.ip8[2], 
	TCFG_SystemData.CTWingCDPServer.ip.ip8[1], TCFG_SystemData.CTWingCDPServer.ip.ip8[0]);
	
	return (char *)TCFG_SystemData.CTWingCDPServerIP;
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_CTWingPort_String(void)
 @Description			TCFG_EEPROM_Get_CTWingPort_String				: 读取CTWingPort字符串
 @Input				void
 @Return				CTWingPort_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_CTWingPort_String(void)
{
	TCFG_SystemData.CTWingCDPServer.port = TCFG_EEPROM_GetCTWingPort();
	
	memset((void*)&TCFG_SystemData.CTWingCDPServerPort, 0, sizeof(TCFG_SystemData.CTWingCDPServerPort));
	sprintf((char *)TCFG_SystemData.CTWingCDPServerPort, "%d", TCFG_SystemData.CTWingCDPServer.port);
	
	return (char *)TCFG_SystemData.CTWingCDPServerPort;
}
#else
/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCTWingIP(unsigned int val)
 @Description			TCFG_EEPROM_SetCTWingIP						: 保存CTWingIP
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCTWingIP(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_CTWING_SERVER_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetCTWingIP(void)
 @Description			TCFG_EEPROM_GetCTWingIP						: 读取CTWingIP
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetCTWingIP(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_CTWING_SERVER_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCTWingPort(unsigned short val)
 @Description			TCFG_EEPROM_SetCTWingPort					: 保存CTWingPort
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCTWingPort(unsigned short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_CTWING_SERVER_OFFSET + 4, val);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_EEPROM_GetCTWingPort(void)
 @Description			TCFG_EEPROM_GetCTWingPort					: 读取CTWingPort
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned short TCFG_EEPROM_GetCTWingPort(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_CTWING_SERVER_OFFSET + 4);
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_CTWingIP_String(void)
 @Description			TCFG_EEPROM_Get_CTWingIP_String				: 读取CTWingIP字符串
 @Input				void
 @Return				CTWingIP_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_CTWingIP_String(void)
{
	return (char *)0;
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_CTWingPort_String(void)
 @Description			TCFG_EEPROM_Get_CTWingPort_String				: 读取CTWingPort字符串
 @Input				void
 @Return				CTWingPort_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_CTWingPort_String(void)
{
	return (char *)0;
}
#endif

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetWorkMode(unsigned char val)
 @Description			TCFG_EEPROM_SetWorkMode						: 保存WorkMode
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetWorkMode(unsigned char val)
{
	FLASH_EEPROM_WriteByte(TCFG_WORKMODE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetWorkMode(void)
 @Description			TCFG_EEPROM_GetWorkMode						: 读取WorkMode
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetWorkMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_WORKMODE_OFFSET);
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_WorkMode_String(void)
 @Description			TCFG_EEPROM_Get_WorkMode_String				: 读取WorkMode字符串
 @Input				void
 @Return				workmode_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_WorkMode_String(void)
{
	if (DeviceIdleMode == true) {
		memset((void*)&TCFG_SystemData.WorkModeStr, 0, sizeof(TCFG_SystemData.WorkModeStr));
		strncpy((char *)TCFG_SystemData.WorkModeStr, "idle", strlen("idle"));
	}
	else if (DeviceActivedMode != true) {
		memset((void*)&TCFG_SystemData.WorkModeStr, 0, sizeof(TCFG_SystemData.WorkModeStr));
		strncpy((char *)TCFG_SystemData.WorkModeStr, "notact", strlen("notact"));
	}
	else if (TCFG_SystemData.WorkMode == NORMAL_WORK) {
		memset((void*)&TCFG_SystemData.WorkModeStr, 0, sizeof(TCFG_SystemData.WorkModeStr));
		strncpy((char *)TCFG_SystemData.WorkModeStr, "norm", strlen("norm"));
	}
	else if (TCFG_SystemData.WorkMode == DEBUG_WORK) {
		memset((void*)&TCFG_SystemData.WorkModeStr, 0, sizeof(TCFG_SystemData.WorkModeStr));
		strncpy((char *)TCFG_SystemData.WorkModeStr, "debug", strlen("debug"));
	}
	else {
		memset((void*)&TCFG_SystemData.WorkModeStr, 0, sizeof(TCFG_SystemData.WorkModeStr));
		strncpy((char *)TCFG_SystemData.WorkModeStr, "unknown", strlen("unknown"));
	}
	
