gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	return (char*)TCFG_SystemData.WorkModeStr;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRadarCount(unsigned int val)
 @Description			TCFG_EEPROM_SetRadarCount					: 保存RadarCount
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRadarCount(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_RADARCOUNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetRadarCount(void)
 @Description			TCFG_EEPROM_GetRadarCount					: 读取RadarCount
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetRadarCount(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_RADARCOUNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_AddRadarCount(void)
 @Description			TCFG_AddRadarCount							: RadarCount++
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_AddRadarCount(void)
{
	TCFG_SystemData.RadarCount++;
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_GetRadarCount(void)
 @Description			TCFG_GetRadarCount							: 获取RadarCount
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_GetRadarCount(void)
{
	return TCFG_SystemData.RadarCount;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetStatusCount(unsigned int val)
 @Description			TCFG_EEPROM_SetStatusCount					: 保存StatusCount
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetStatusCount(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_STATUSCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetStatusCount(void)
 @Description			TCFG_EEPROM_GetStatusCount					: 读取StatusCount
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetStatusCount(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_STATUSCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRfChannel(unsigned char val)
 @Description			TCFG_EEPROM_SetRfChannel						: 保存RfChannel
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRfChannel(unsigned char val)
{
	FLASH_EEPROM_WriteByte(TCFG_RFCHANNEL_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRfChannel(void)
 @Description			TCFG_EEPROM_GetRfChannel						: 读取RfChannel
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRfChannel(void)
{
	unsigned char val;
	
	val = FLASH_EEPROM_ReadByte(TCFG_RFCHANNEL_OFFSET);
	switch (val)
	{
	case 36:
		val = 36;
		break;
	case 4:
		val = 4;
		break;
	case 6:
		val = 6;
		break;
	case 16:
		val = 16;
		break;
	case 26:
		val = 26;
		break;
	default:
		val = 36;
		break;
	}
	
	return val;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRFDprintLv(uint8_t val)
 @Description			TCFG_EEPROM_SetRFDprintLv					: 保存RFDprintLv
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRFDprintLv(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_RF_DPRINT_LV_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRFDprintLv(void)
 @Description			TCFG_EEPROM_GetRFDprintLv					: 读取RFDprintLv
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRFDprintLv(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RF_DPRINT_LV_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetActiveDeice(unsigned char val)
 @Description			TCFG_EEPROM_SetActiveDeice					: 保存ActiveDeice
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetActiveDevice(unsigned char val)
{
	if (val) val = 0;
	else val = 1;
	FLASH_EEPROM_WriteByte(TCFG_ACTIVE_DEVICE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetActiveDeice(void)
 @Description			TCFG_EEPROM_GetActiveDeice					: 读取ActiveDeice
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetActiveDevice(void)
{
	if (1 == FLASH_EEPROM_ReadByte(TCFG_ACTIVE_DEVICE_OFFSET)) {
		return 0;
	}
	else {
		return 1;
	}
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetNbiotBootCnt(unsigned int val)
 @Description			TCFG_EEPROM_SetNbiotBootCnt					: 保存NbiotBootCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetNbiotBootCnt(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_NBIOT_BOOTCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetNbiotBootCnt(void)
 @Description			TCFG_EEPROM_GetNbiotBootCnt					: 读取NbiotBootCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetNbiotBootCnt(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_NBIOT_BOOTCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetNBIotSentCount(unsigned int val)
 @Description			TCFG_EEPROM_SetNBIotSentCount					: 保存NBIotSentCount
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetNBIotSentCount(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_NBIOT_SENTCOUNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetNBIotSentCount(void)
 @Description			TCFG_EEPROM_GetNBIotSentCount					: 读取NBIotSentCount
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetNBIotSentCount(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_NBIOT_SENTCOUNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetNBIotRecvCount(unsigned int val)
 @Description			TCFG_EEPROM_SetNBIotRecvCount					: 保存NBIotRecvCount
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetNBIotRecvCount(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_NBIOT_RECVCOUNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetNBIotRecvCount(void)
 @Description			TCFG_EEPROM_GetNBIotRecvCount					: 读取NBIotRecvCount
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetNBIotRecvCount(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_NBIOT_RECVCOUNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetNBIotSentCountDay(unsigned short val)
 @Description			TCFG_EEPROM_SetNBIotSentCountDay				: 保存NBIotSentCountDay
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetNBIotSentCountDay(unsigned short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_NBIOT_SENTCNTDAY_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_EEPROM_GetNBIotSentCountDay(void)
 @Description			TCFG_EEPROM_GetNBIotSentCountDay				: 读取NBIotSentCountDay
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned short TCFG_EEPROM_GetNBIotSentCountDay(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_NBIOT_SENTCNTDAY_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetNBIotSentCountLimit(unsigned short val)
 @Description			TCFG_EEPROM_SetNBIotSentCountLimit				: 保存NBIotSentCountLimit
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetNBIotSentCountLimit(unsigned short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_NBIOT_SENTCNTLMT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_EEPROM_GetNBIotSentCountLimit(void)
 @Description			TCFG_EEPROM_GetNBIotSentCountLimit				: 读取NBIotSentCountLimit
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned short TCFG_EEPROM_GetNBIotSentCountLimit(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_NBIOT_SENTCNTLMT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetDevBootCnt(unsigned short val)
 @Description			TCFG_EEPROM_SetDevBootCnt					: 保存DevBootCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetDevBootCnt(unsigned short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_DEV_BOOTCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_EEPROM_GetDevBootCnt(void)
 @Description			TCFG_EEPROM_GetDevBootCnt					: 读取DevBootCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned short TCFG_EEPROM_GetDevBootCnt(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_DEV_BOOTCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetEventTime(unsigned int val)
 @Description			TCFG_EEPROM_SetEventTime						: 保存EventTime
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetEventTime(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_EVENT_TIME_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetEventTime(void)
 @Description			TCFG_EEPROM_GetEventTime						: 读取EventTime
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetEventTime(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_EVENT_TIME_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetBackgroundTemp(int16_t val)
 @Description			TCFG_EEPROM_SetBackgroundTemp					: 保存BackgroundTemp
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetBackgroundTemp(int16_t val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_TEMP_BACKGROUND_OFFSET, val);
}

/**********************************************************************************************************
 @Function			int16_t TCFG_EEPROM_GetBackgroundTemp(void)
 @Description			TCFG_EEPROM_GetBackgroundTemp					: 读取BackgroundTemp
 @Input				void
 @Return				val
**********************************************************************************************************/
int16_t TCFG_EEPROM_GetBackgroundTemp(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_TEMP_BACKGROUND_OFFSET);
}

/**********************************************************************************************************
 @Function			bool TCFG_EEPROM_CheckInfoBurned(void)
 @Description			TCFG_EEPROM_CheckInfoBurned					: 检测生产商信息
 @Input				void
 @Return				bool
**********************************************************************************************************/
bool TCFG_EEPROM_CheckInfoBurned(void)
{
	if ( (0x00 == FLASH_EEPROM_ReadByte(TCFG_FACTORY_BRAND_SN_OFFSET + 0)) && \
		(0x00 == FLASH_EEPROM_ReadByte(TCFG_FACTORY_BRAND_SN_OFFSET + 1)) && \
		(0x00 == FLASH_EEPROM_ReadByte(TCFG_FACTORY_BRAND_SN_OFFSET + 2)) && \
		(0x00 == FLASH_EEPROM_ReadByte(TCFG_FACTORY_BRAND_SN_OFFSET + 3)) ) {
		return false;
	}
	else {
		return true;
	}
}

/**********************************************************************************************************
 @Function			bool TCFG_EEPROM_CheckNewSNorBrand(void)
 @Description			TCFG_EEPROM_CheckNewSNorBrand					: 检测新的设备号或厂牌信息
 @Input				void
 @Return				bool
**********************************************************************************************************/
bool TCFG_EEPROM_CheckNewSNorBrand(void)
{
	bool ret = false;
	char vender[4];
	unsigned int Brand = 0;
	
	/* 之前不为此固件,备份域为空 */
	if ((TCFG_EEPROM_GetSNfromBrandKey() == 0) && (TCFG_EEPROM_GetFactoryBrand() == 0)) {
		/* 写入生产商与设备号至备份域 */
		TCFG_EEPROM_SetSNfromBrandKey(TCFG_EEPROM_Get_MAC_SN());
		TCFG_EEPROM_GetVender(vender);
		Brand |= (vender[0] & 0x000000FF) << 3*8;
		Brand |= (vender[1] & 0x000000FF) << 2*8;
		Brand |= (vender[2] & 0x000000FF) << 1*8;
		Brand |= (vender[3] & 0x000000FF) << 0*8;
		TCFG_EEPROM_SetFactoryBrand(Brand);
		ret = true;
		goto exit;
	}
	
	/* 设备号与备份域设备号不同,需恢复EEPROM出厂设置 */
	if (TCFG_EEPROM_Get_MAC_SN() != TCFG_EEPROM_GetSNfromBrandKey()) {			//设备号不同
		ret = true;
		goto exit;
	}
	
	/* 厂牌号与备份域厂牌号不同,需恢复EEPROM出厂设置 */
	TCFG_EEPROM_GetVender(vender);
	Brand |= (vender[0] & 0x000000FF) << 3*8;
	Brand |= (vender[1] & 0x000000FF) << 2*8;
	Brand |= (vender[2] & 0x000000FF) << 1*8;
	Brand |= (vender[3] & 0x000000FF) << 0*8;
	if (Brand != TCFG_EEPROM_GetFactoryBrand()) {							//厂牌号不同
		ret = true;
		goto exit;
	}
	
