gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
exit:
	return ret;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetSNfromBrandKey(unsigned int val)
 @Description			TCFG_EEPROM_SetSNfromBrandKey					: 保存SNfromBrandKey
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetSNfromBrandKey(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_FACTORY_BRAND_SN_OFFSET + 4, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetSNfromBrandKey(void)
 @Description			TCFG_EEPROM_GetSNfromBrandKey					: 读取SNfromBrandKey
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetSNfromBrandKey(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORY_BRAND_SN_OFFSET + 4);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetFactoryBrand(unsigned int val)
 @Description			TCFG_EEPROM_SetFactoryBrand					: 保存FactoryBrand
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetFactoryBrand(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_FACTORY_BRAND_SN_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetFactoryBrand(void)
 @Description			TCFG_EEPROM_GetFactoryBrand					: 读取FactoryBrand
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetFactoryBrand(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORY_BRAND_SN_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_Set_MAC_SN(unsigned int subsn)
 @Description			TCFG_EEPROM_Set_MAC_SN						: 保存MAC SN
 @Input				sn
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_Set_MAC_SN(unsigned int sn)
{
	unsigned int subsn = 0;
	
	subsn |= (sn & 0xFF000000) >> 3*8;
	subsn |= (sn & 0x00FF0000) >> 1*8;
	subsn |= (sn & 0x0000FF00) << 1*8;
	subsn |= (sn & 0x000000FF) << 3*8;
	
	FLASH_EEPROM_WriteWord(TCFG_FACTORY_MAC_SN_OFFSET, subsn);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_Get_MAC_SN(void)
 @Description			TCFG_EEPROM_Get_MAC_SN						: 读取MAC SN
 @Input				void
 @Return				sn
**********************************************************************************************************/
unsigned int TCFG_EEPROM_Get_MAC_SN(void)
{
	unsigned int subsn = 0;
	unsigned int sn = 0;
	
	subsn = FLASH_EEPROM_ReadWord(TCFG_FACTORY_MAC_SN_OFFSET);
	sn |= (subsn & 0xFF000000) >> 3*8;
	sn |= (subsn & 0x00FF0000) >> 1*8;
	sn |= (subsn & 0x0000FF00) << 1*8;
	sn |= (subsn & 0x000000FF) << 3*8;
	
	sn = (sn == 0) ? 1 : sn;
	
	return sn;
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_MAC_SN_String(void)
 @Description			TCFG_EEPROM_Get_MAC_SN_String					: 读取MAC SN字符串
 @Input				void
 @Return				sn_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_MAC_SN_String(void)
{
	unsigned int subsn = 0;
	unsigned int sn = 0;
	
	subsn = FLASH_EEPROM_ReadWord(TCFG_FACTORY_MAC_SN_OFFSET);
	sn |= (subsn & 0xFF000000) >> 3*8;
	sn |= (subsn & 0x00FF0000) >> 1*8;
	sn |= (subsn & 0x0000FF00) << 1*8;
	sn |= (subsn & 0x000000FF) << 3*8;
	
	sn = (sn == 0) ? 1 : sn;
	
	memset((void *)TCFG_SystemData.SubMacSN, 0x0, sizeof(TCFG_SystemData.SubMacSN));
	sprintf((char*)TCFG_SystemData.SubMacSN, "%08x", sn);
	
	return (char*)TCFG_SystemData.SubMacSN;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetVender(char* vender)
 @Description			TCFG_EEPROM_SetVender						: 保存vender
 @Input				&vender
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetVender(char* vender)
{
	FLASH_EEPROM_WriteBuffer(TCFG_FACTORY_VENDER_OFFSET, (unsigned char*)vender, TCFG_FACTORY_VENDER_LENGTH);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_GetVender(char* vender)
 @Description			TCFG_EEPROM_GetVender						: 读取vender
 @Input				&vender
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_GetVender(char* vender)
{
	FLASH_EEPROM_ReadBuffer(TCFG_FACTORY_VENDER_OFFSET, (unsigned char*)vender, TCFG_FACTORY_VENDER_LENGTH);
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_Vender_String(void)
 @Description			TCFG_EEPROM_Get_Vender_String					: 读取vender字符串
 @Input				void
 @Return				vender_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_Vender_String(void)
{
	TCFG_EEPROM_GetVender((char *)&TCFG_SystemData.SubVender);
	
	return (char*)TCFG_SystemData.SubVender;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetMagMode(uint8_t val)
 @Description			TCFG_EEPROM_SetMagMode						: 保存MagMode
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetMagMode(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_MAG_MODE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			uint8_t TCFG_EEPROM_GetMagMode(void)
 @Description			TCFG_EEPROM_GetMagMode						: 读取MagMode
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetMagMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_MAG_MODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetSenseMode(uint8_t val)
 @Description			TCFG_EEPROM_SetSenseMode						: 保存 sense mode
 @Input				val 0=both sensors,1=magnetic only,2=radar only
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetSenseMode(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_SENSE_MODE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetSenseMode(void)
 @Description			TCFG_EEPROM_GetSenseMode						: 读取 sense mode
 @Input				void
 @Return				val 0=both sensors,1=magnetic only,2=radar only
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetSenseMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_SENSE_MODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetNbiotHeart(uint8_t val)
 @Description			TCFG_EEPROM_SetNbiotHeart					: 保存NbiotHeart
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetNbiotHeart(uint8_t val)
{
	if (val == 0) {
		val = NBIOT_HEART_DATA_TIMER;
	}
	else if (val > 192) {
		val = 192;
	}
	
	FLASH_EEPROM_WriteByte(TCFG_NB_HEART_OFFSET, val);
}

/**********************************************************************************************************
 @Function			uint8_t TCFG_EEPROM_GetNbiotHeart(void)
 @Description			TCFG_EEPROM_GetNbiotHeart					: 读取NbiotHeart
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetNbiotHeart(void)
{
	unsigned char val = 0;
	
	val = FLASH_EEPROM_ReadByte(TCFG_NB_HEART_OFFSET);
	if (val == 0) {
		val = NBIOT_HEART_DATA_TIMER;
	}
	else if (val > 192) {
		val = 192;
	}
	
	return val;
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_ChangeNbiotHeart(uint8_t val)
 @Description			TCFG_EEPROM_ChangeNbiotHeart					: 转换NbiotHeart
 @Input				val
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_ChangeNbiotHeart(uint8_t val)
{
	if ((val > 0) && (val <= 10)) {
		return (val * 4);
	}
	else if (val > 10) {
		return (val - 10);
	}
	
