gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	return 0;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRadarRange(uint8_t val)
 @Description			TCFG_EEPROM_SetRadarRange					: 保存RadarRange
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRadarRange(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_RADAR_RANGE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRadarRange(void)
 @Description			TCFG_EEPROM_GetRadarRange					: 读取RadarRange
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRadarRange(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RADAR_RANGE_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCoverGain(unsigned char val)
 @Description			TCFG_EEPROM_SetCoverGain						: 保存 radar gain in cover
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCoverGain(unsigned char val)
{
	FLASH_EEPROM_WriteByte(TCFG_RADAR_COVER_GAIN_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetCoverGain(void)
 @Description			TCFG_EEPROM_GetCoverGain						: 读取 radar gain in cover
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetCoverGain(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RADAR_COVER_GAIN_OFFSET); 
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRadarGain(unsigned char val)
 @Description			TCFG_EEPROM_SetRadarGain						: 保存 radar gain
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRadarGain(unsigned char val)
{
	FLASH_EEPROM_WriteByte(TCFG_RADAR_GAIN_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRadarGain(void)
 @Description			TCFG_EEPROM_GetRadarGain						: 读取 radar gain
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRadarGain(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RADAR_GAIN_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetHighPass(unsigned char val)
 @Description			TCFG_EEPROM_SetHighPass						: 保存 cut-off frequency of high pass
 @Input				val		RADAR_HIGHPASS_800  = 1,
							RADAR_HIGHPASS_900  = 2,
							RADAR_HIGHPASS_1000 = 3,
							RADAR_HIGHPASS_1100 = 4,
							RADAR_HIGHPASS_1200 = 5,
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetHighPass(unsigned char val)
{
	FLASH_EEPROM_WriteByte(TCFG_RADAR_HIGHPASS_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetHighPass(void)
 @Description			TCFG_EEPROM_GetHighPass						: 读取 cut-off frequency of high pass
 @Input				void
 @Return				val		RADAR_HIGHPASS_800  = 1,
							RADAR_HIGHPASS_900  = 2,
							RADAR_HIGHPASS_1000 = 3,
							RADAR_HIGHPASS_1100 = 4,
							RADAR_HIGHPASS_1200 = 5,
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetHighPass(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RADAR_HIGHPASS_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetSampleInterval(unsigned char val)
 @Description			TCFG_EEPROM_SetSampleInterval					: 保存 采样间隔
 @Input				val 	4~13
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetSampleInterval(unsigned char val)
{
	FLASH_EEPROM_WriteByte(TCFG_RADAR_SAMPLEINTERVAL_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetSampleInterval(void)
 @Description			TCFG_EEPROM_GetSampleInterval					: 读取 采样间隔
 @Input				void
 @Return				val 	4~13
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetSampleInterval(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RADAR_SAMPLEINTERVAL_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCarInDelay(uint8_t val)
 @Description			TCFG_EEPROM_SetCarInDelay					: 保存CarInDelay
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCarInDelay(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_CARIN_DELAY_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetCarInDelay(void)
 @Description			TCFG_EEPROM_GetCarInDelay					: 读取CarInDelay
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetCarInDelay(void)
{
	unsigned char val;
	
	val = FLASH_EEPROM_ReadByte(TCFG_CARIN_DELAY_OFFSET);
	if (val < 8) {
		val = 8;
	}
	
	return val;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRFCmdCnt(uint8_t val)
 @Description			TCFG_EEPROM_SetRFCmdCnt						: 保存RFCmdCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRFCmdCnt(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_RF_CMDCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRFCmdCnt(void)
 @Description			TCFG_EEPROM_GetRFCmdCnt						: 读取RFCmdCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRFCmdCnt(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RF_CMDCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetNBCmdCnt(uint8_t val)
 @Description			TCFG_EEPROM_SetNBCmdCnt						: 保存NBCmdCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetNBCmdCnt(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_NB_CMDCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetNBCmdCnt(void)
 @Description			TCFG_EEPROM_GetNBCmdCnt						: 读取NBCmdCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetNBCmdCnt(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_NB_CMDCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCoapRATimeHour(unsigned char val)
 @Description			TCFG_EEPROM_SetCoapRATimeHour					: 保存CoapRATimeHour
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCoapRATimeHour(unsigned char val)
{
	if (val > 12) val = 12;
	FLASH_EEPROM_WriteByte(TCFG_COAP_RA_TIME_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetCoapRATimeHour(void)
 @Description			TCFG_EEPROM_GetCoapRATimeHour					: 读取CoapRATimeHour
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetCoapRATimeHour(void)
{
	unsigned char val8;
	
	val8 = FLASH_EEPROM_ReadByte(TCFG_COAP_RA_TIME_OFFSET);
	if (val8 > 12) val8 = 12;
	
	return val8;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCoapConnectTime(unsigned int val)
 @Description			TCFG_EEPROM_SetCoapConnectTime				: 保存CoapConnectTime
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCoapConnectTime(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_COAP_CON_TIME_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetCoapConnectTime(void)
 @Description			TCFG_EEPROM_GetCoapConnectTime				: 读取CoapConnectTime
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetCoapConnectTime(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_COAP_CON_TIME_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCoapIdleTime(unsigned int val)
 @Description			TCFG_EEPROM_SetCoapIdleTime					: 保存CoapIdleTime
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCoapIdleTime(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_COAP_IDLE_TIME_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetCoapIdleTime(void)
 @Description			TCFG_EEPROM_GetCoapIdleTime					: 读取CoapIdleTime
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetCoapIdleTime(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_COAP_IDLE_TIME_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetUpgradeLimitRssi(short val)
 @Description			TCFG_EEPROM_SetUpgradeLimitRssi				: 保存UpgradeLimitRssi
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetUpgradeLimitRssi(short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_UPDATA_LIMITRSSI_OFFSET, val);
}

/**********************************************************************************************************
 @Function			short TCFG_EEPROM_GetUpgradeLimitRssi(void)
 @Description			TCFG_EEPROM_GetUpgradeLimitRssi				: 读取UpgradeLimitRssi
 @Input				void
 @Return				val
**********************************************************************************************************/
short TCFG_EEPROM_GetUpgradeLimitRssi(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_UPDATA_LIMITRSSI_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetUpgradeLimitSnr(short val)
 @Description			TCFG_EEPROM_SetUpgradeLimitSnr				: 保存UpgradeLimitSnr
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetUpgradeLimitSnr(short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_UPDATA_LIMITSNR_OFFSET, val);
}

/**********************************************************************************************************
 @Function			short TCFG_EEPROM_GetUpgradeLimitSnr(void)
 @Description			TCFG_EEPROM_GetUpgradeLimitSnr				: 读取UpgradeLimitSnr
 @Input				void
 @Return				val
**********************************************************************************************************/
short TCFG_EEPROM_GetUpgradeLimitSnr(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_UPDATA_LIMITSNR_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetBeepOff(uint8_t val)
 @Description			TCFG_EEPROM_SetBeepOff						: 保存BeepOff
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetBeepOff(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_BEEP_OFF_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetBeepOff(void)
 @Description			TCFG_EEPROM_GetBeepOff						: 读取BeepOff
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetBeepOff(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_BEEP_OFF_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRollingOverInitSensor(uint8_t val)
 @Description			TCFG_EEPROM_SetRollingOverInitSensor			: 保存RollingOverInitSensor
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRollingOverInitSensor(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_ROLL_INITSENSOR_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRollingOverInitSensor(void)
 @Description			TCFG_EEPROM_GetRollingOverInitSensor			: 读取RollingOverInitSensor
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRollingOverInitSensor(void)
{
#if ROLLINGOVER_INITSENSOR_TYPE
	return ROLLINGOVER_INITSENSOR_TYPE;
#else
	return FLASH_EEPROM_ReadByte(TCFG_ROLL_INITSENSOR_OFFSET);
#endif
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetDeviceRbtMode(uint8_t val)
 @Description			TCFG_EEPROM_SetDeviceRbtMode					: 保存DeviceRbtMode
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetDeviceRbtMode(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_DEVICE_RBTMODE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetDeviceRbtMode(void)
 @Description			TCFG_EEPROM_GetDeviceRbtMode					: 读取DeviceRbtMode
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetDeviceRbtMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_DEVICE_RBTMODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetMqttSNIP(unsigned int val)
 @Description			TCFG_EEPROM_SetMqttSNIP						: 保存MqttSNIP
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetMqttSNIP(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_MQTTSN_SERVER_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetMqttSNIP(void)
 @Description			TCFG_EEPROM_GetMqttSNIP						: 读取MqttSNIP
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetMqttSNIP(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_MQTTSN_SERVER_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetMqttSNPort(unsigned short val)
 @Description			TCFG_EEPROM_SetMqttSNPort					: 保存MqttSNPort
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetMqttSNPort(unsigned short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_MQTTSN_SERVER_OFFSET + 4, val);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_EEPROM_GetMqttSNPort(void)
 @Description			TCFG_EEPROM_GetMqttSNPort					: 读取MqttSNPort
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned short TCFG_EEPROM_GetMqttSNPort(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_MQTTSN_SERVER_OFFSET + 4);
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_MqttSNIP_String(void)
 @Description			TCFG_EEPROM_Get_MqttSNIP_String				: 读取MqttSNIP字符串
 @Input				void
 @Return				MqttSNIP_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_MqttSNIP_String(void)
{
	TCFG_SystemData.NBMqttSNServer.ip.ip32 = TCFG_EEPROM_GetMqttSNIP();
	
	memset((void*)&TCFG_SystemData.NBMqttSNServerIP, 0, sizeof(TCFG_SystemData.NBMqttSNServerIP));
	sprintf((char *)TCFG_SystemData.NBMqttSNServerIP, "%d.%d.%d.%d", 
	TCFG_SystemData.NBMqttSNServer.ip.ip8[3], TCFG_SystemData.NBMqttSNServer.ip.ip8[2], 
	TCFG_SystemData.NBMqttSNServer.ip.ip8[1], TCFG_SystemData.NBMqttSNServer.ip.ip8[0]);
	
	return (char *)TCFG_SystemData.NBMqttSNServerIP;
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_MqttSNPort_String(void)
 @Description			TCFG_EEPROM_Get_MqttSNPort_String				: 读取MqttSNPort字符串
 @Input				void
 @Return				MqttSNPort_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_MqttSNPort_String(void)
{
	TCFG_SystemData.NBMqttSNServer.port = TCFG_EEPROM_GetMqttSNPort();
	
	memset((void*)&TCFG_SystemData.NBMqttSNServerPort, 0, sizeof(TCFG_SystemData.NBMqttSNServerPort));
	sprintf((char *)TCFG_SystemData.NBMqttSNServerPort, "%d", TCFG_SystemData.NBMqttSNServer.port);
	
