gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	return (char *)TCFG_SystemData.NBMqttSNServerPort;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_Device_BootCount(void)
 @Description			TCFG_Utility_Add_Device_BootCount				: Device重启次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_Device_BootCount(void)
{
	TCFG_SystemData.DeviceBootCount = TCFG_EEPROM_GetDevBootCnt() + 1;
	TCFG_EEPROM_SetDevBootCnt(TCFG_SystemData.DeviceBootCount);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Device_BootCount(void)
 @Description			TCFG_Utility_Get_Device_BootCount				: Device重启次数获取
 @Input				void
 @Return				Device_BootCount
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Device_BootCount(void)
{
	return TCFG_SystemData.DeviceBootCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_Nbiot_BootCount(void)
 @Description			TCFG_Utility_Add_Nbiot_BootCount				: NBIot重启次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_Nbiot_BootCount(void)
{
	TCFG_SystemData.NBIotBootCount++;
	if (TCFG_SystemData.NBIotBootCount > (10 + TCFG_EEPROM_GetNbiotBootCnt())) {
		TCFG_EEPROM_SetNbiotBootCnt(TCFG_SystemData.NBIotBootCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_BootCount(void)
 @Description			TCFG_Utility_Get_Nbiot_BootCount				: NBIot重启次数获取
 @Input				void
 @Return				Nbiot_BootCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_BootCount(void)
{
	return TCFG_SystemData.NBIotBootCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_NBIot_SentCount(void)
 @Description			TCFG_Utility_Add_NBIot_SentCount				: NBIot 发送次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_NBIot_SentCount(void)
{
	TCFG_SystemData.NBIotSentCount++;
	if (TCFG_SystemData.NBIotSentCount > (10 + TCFG_EEPROM_GetNBIotSentCount())) {
		TCFG_EEPROM_SetNBIotSentCount(TCFG_SystemData.NBIotSentCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_NBIot_SentCount(void)
 @Description			TCFG_Utility_Get_NBIot_SentCount				: NBIot 发送次数获取
 @Input				void
 @Return				SentCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_NBIot_SentCount(void)
{
	return TCFG_SystemData.NBIotSentCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_NBIot_RecvCount(void)
 @Description			TCFG_Utility_Add_NBIot_RecvCount				: NBIot 接收次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_NBIot_RecvCount(void)
{
	TCFG_SystemData.NBIotRecvCount++;
	if (TCFG_SystemData.NBIotRecvCount > (10 + TCFG_EEPROM_GetNBIotRecvCount())) {
		TCFG_EEPROM_SetNBIotRecvCount(TCFG_SystemData.NBIotRecvCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_NBIot_RecvCount(void)
 @Description			TCFG_Utility_Get_NBIot_RecvCount				: NBIot 接收次数获取
 @Input				void
 @Return				RecvCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_NBIot_RecvCount(void)
{
	return TCFG_SystemData.NBIotRecvCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_NBIot_SentCountDay(void)
 @Description			TCFG_Utility_Add_NBIot_SentCountDay			: NBIot 一天发送次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_NBIot_SentCountDay(void)
{
	TCFG_SystemData.NBIotSentCountDay++;
	if (TCFG_SystemData.NBIotSentCountDay > (10 + TCFG_EEPROM_GetNBIotSentCountDay())) {
		TCFG_EEPROM_SetNBIotSentCountDay(TCFG_SystemData.NBIotSentCountDay);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_NBIot_SentCountDay(void)
 @Description			TCFG_Utility_Get_NBIot_SentCountDay			: NBIot 一天发送次数获取
 @Input				void
 @Return				SentCountDay
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_NBIot_SentCountDay(void)
{
	return TCFG_SystemData.NBIotSentCountDay;
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_NBIot_SentCountLimit(void)
 @Description			TCFG_Utility_Get_NBIot_SentCountLimit			: NBIot 一天剩余次数获取
 @Input				void
 @Return				SentCountLimit
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_NBIot_SentCountLimit(void)
{
	unsigned short countLimit = (TCFG_Utility_Get_NBIot_SentCountDay() > TCFG_EEPROM_GetNBIotSentCountLimit()) ? TCFG_EEPROM_GetNBIotSentCountLimit() : TCFG_Utility_Get_NBIot_SentCountDay();
	return TCFG_EEPROM_GetNBIotSentCountLimit() - countLimit;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Set_Nbiot_IdleLifetime(unsigned short val)
 @Description			TCFG_Utility_Set_Nbiot_IdleLifetime			: NBIot 休眠模式保活时间设置
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Set_Nbiot_IdleLifetime(unsigned short val)
{
	TCFG_SystemData.NBIdleLifetime = (val > 30) ? 30 : val;
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Nbiot_IdleLifetime(void)
 @Description			TCFG_Utility_Get_Nbiot_IdleLifetime			: NBIot 休眠模式保活时间获取
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Nbiot_IdleLifetime(void)
{
	return TCFG_SystemData.NBIdleLifetime;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Sub_Nbiot_IdleLifetime(void)
 @Description			TCFG_Utility_Sub_Nbiot_IdleLifetime			: NBIot 休眠模式保活时间递减
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Sub_Nbiot_IdleLifetime(void)
{
	if (TCFG_SystemData.NBIdleLifetime > 0) {
		TCFG_SystemData.NBIdleLifetime--;
	}
}

#if NBIOT_ATCMD_GET_ICCID
/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Iccid_String(void)
 @Description			TCFG_Utility_Get_Nbiot_Iccid_String			: 读取Nbiot Iccid字符串
 @Input				void
 @Return				Nbiot_Iccid
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Iccid_String(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)NbiotClientHandler.Parameter.iccid;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNClientHandler.SocketStack->NBIotStack->Parameter.iccid;
#elif NETPROTOCAL == NETONENET
	return (char*)OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.iccid;
#elif NETPROTOCAL == NETCTWING
	return (char*)CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.iccid;
#endif
}
#endif

