gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
#if NBIOT_ATCMD_GET_IMEI
/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Imei_String(void)
 @Description			TCFG_Utility_Get_Nbiot_Imei_String				: 读取Nbiot Imei字符串
 @Input				void
 @Return				Nbiot_Imei
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Imei_String(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)NbiotClientHandler.Parameter.imei;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNClientHandler.SocketStack->NBIotStack->Parameter.imei;
#elif NETPROTOCAL == NETONENET
	return (char*)OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.imei;
#elif NETPROTOCAL == NETCTWING
	return (char*)CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.imei;
#endif
}
#endif

#if NBIOT_ATCMD_GET_IMEISV
/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Imeisv_String(void)
 @Description			TCFG_Utility_Get_Nbiot_Imeisv_String			: 读取Nbiot Imeisv字符串
 @Input				void
 @Return				Nbiot_Imeisv
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Imeisv_String(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)NbiotClientHandler.Parameter.imeisv;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNClientHandler.SocketStack->NBIotStack->Parameter.imeisv;
#elif NETPROTOCAL == NETONENET
	return (char*)OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.imeisv;
#elif NETPROTOCAL == NETCTWING
	return (char*)CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.imeisv;
#endif
}
#endif

#if NBIOT_ATCMD_GET_IMSI
/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Imsi_String(void)
 @Description			TCFG_Utility_Get_Nbiot_Imsi_String				: 读取Nbiot Imesi字符串
 @Input				void
 @Return				Nbiot_Imsi
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Imsi_String(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)NbiotClientHandler.Parameter.imsi;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNClientHandler.SocketStack->NBIotStack->Parameter.imsi;
#elif NETPROTOCAL == NETONENET
	return (char*)OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.imsi;
#elif NETPROTOCAL == NETCTWING
	return (char*)CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.imsi;
#endif
}
#endif

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_Rssi_IntVal(void)
 @Description			TCFG_Utility_Get_Nbiot_Rssi_IntVal				: 读取Nbiot Rssi值
 @Input				void
 @Return				Nbiot_Rssi
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_Rssi_IntVal(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.rssi;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.rssi;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.rssi;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.rssi;
#endif
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_Rssi_UnCharVal(void)
 @Description			TCFG_Utility_Get_Nbiot_Rssi_UnCharVal			: 读取Nbiot Rssi值
 @Input				void
 @Return				Nbiot_Rssi
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_Rssi_UnCharVal(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.rssi;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.rssi;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.rssi;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.rssi;
#endif
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_WorkMode(void)
 @Description			TCFG_Utility_Get_Nbiot_WorkMode				: 读取Nbiot WorkMode值
 @Input				void
 @Return				Nbiot_Rssi
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_WorkMode(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.connectedstate;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.connectedstate;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.connectedstate;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.connectedstate;
#endif
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_Registered(void)
 @Description			TCFG_Utility_Get_Nbiot_Registered				: 读取Nbiot Registered值
 @Input				void
 @Return				Nbiot_Registered
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_Registered(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Registered;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Registered;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Registered;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Registered;
#endif
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_NetStateIdentification(void)
 @Description			TCFG_Utility_Get_Nbiot_NetStateIdentification		: 读取Nbiot NetStateIdentification值
 @Input				void
 @Return				Nbiot_NetStateIdentification
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_NetStateIdentification(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.NetStateIdentification;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->NetStateIdentification;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->NetStateIdentification;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->NetStateIdentification;
#endif
}

#if NBIOT_ATCMD_GET_AREACODE
/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_NetworkRegStatusTac(void)
 @Description			TCFG_Utility_Get_Nbiot_NetworkRegStatusTac		: 读取Nbiot NetworkRegStatusTac值
 @Input				void
 @Return				NetworkRegStatusTac
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_NetworkRegStatusTac(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.networkRegStatus.tac;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.networkRegStatus.tac;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.networkRegStatus.tac;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.networkRegStatus.tac;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_NetworkRegStatusCellID(void)
 @Description			TCFG_Utility_Get_Nbiot_NetworkRegStatusCellID	: 读取Nbiot NetworkRegStatusCellID值
 @Input				void
 @Return				NetworkRegStatusCellID
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_NetworkRegStatusCellID(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.networkRegStatus.cellID;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.networkRegStatus.cellID;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.networkRegStatus.cellID;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.networkRegStatus.cellID;
#endif
}
#endif

#if NBIOT_ATCMD_GET_STATISTICSRADIO
/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioSignalpower(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioSignalpower			: 读取Nbiot RadioSignalpower值
 @Input				void
 @Return				RadioSignalpower
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioSignalpower(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.Signalpower;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.Signalpower;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.Signalpower;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.Signalpower;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioTotalpower(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioTotalpower			: 读取Nbiot RadioTotalpower值
 @Input				void
 @Return				RadioTotalpower
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioTotalpower(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.Totalpower;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.Totalpower;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.Totalpower;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.Totalpower;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioTXpower(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioTXpower			: 读取Nbiot RadioTXpower值
 @Input				void
 @Return				RadioTXpower
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioTXpower(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.TXpower;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.TXpower;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.TXpower;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.TXpower;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RadioTXtime(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioTXtime				: 读取Nbiot RadioTXtime值
 @Input				void
 @Return				RadioTXtime
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RadioTXtime(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.TXtime;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.TXtime;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.TXtime;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.TXtime;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RadioRXtime(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioRXtime				: 读取Nbiot RadioRXtime值
 @Input				void
 @Return				RadioRXtime
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RadioRXtime(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.RXtime;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.RXtime;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.RXtime;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.RXtime;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RadioCellID(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioCellID				: 读取Nbiot RadioCellID值
 @Input				void
 @Return				RadioCellID
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RadioCellID(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.CellID;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.CellID;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.CellID;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.CellID;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioECL(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioECL				: 读取Nbiot RadioECL值
 @Input				void
 @Return				RadioECL
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioECL(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.ECL;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.ECL;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.ECL;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.ECL;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioSNR(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioSNR				: 读取Nbiot RadioSNR值
 @Input				void
 @Return				RadioSNR
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioSNR(void)
{
	int nbRadioSnr = 0;
	int lastval = 0;
	
#if NETPROTOCAL == NETCOAP
	lastval = NbiotClientHandler.Parameter.statisticsRADIO.SNR % 10;
	nbRadioSnr = (NbiotClientHandler.Parameter.statisticsRADIO.SNR >=  127) ?  127 : NbiotClientHandler.Parameter.statisticsRADIO.SNR;
	NbiotClientHandler.Parameter.statisticsRADIO.SNR = nbRadioSnr;
	nbRadioSnr = (NbiotClientHandler.Parameter.statisticsRADIO.SNR <= -128) ? -128 : NbiotClientHandler.Parameter.statisticsRADIO.SNR;
	NbiotClientHandler.Parameter.statisticsRADIO.SNR = nbRadioSnr;
#elif NETPROTOCAL == NETMQTTSN
	lastval = MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.SNR % 10;
	nbRadioSnr = (MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.SNR >=  127) ?  127 : MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.SNR;
	MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.SNR = nbRadioSnr;
	nbRadioSnr = (MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.SNR <= -128) ? -128 : MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.SNR;
	MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.SNR = nbRadioSnr;
#elif NETPROTOCAL == NETONENET
	lastval = OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR % 10;
	nbRadioSnr = (OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR >=  127) ?  127 : OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR;
	OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR = nbRadioSnr;
	nbRadioSnr = (OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR <= -128) ? -128 : OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR;
	OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR = nbRadioSnr;
#elif NETPROTOCAL == NETCTWING
	lastval = CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR % 10;
	nbRadioSnr = (CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR >=  127) ?  127 : CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR;
	CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR = nbRadioSnr;
	nbRadioSnr = (CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR <= -128) ? -128 : CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR;
	CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR = nbRadioSnr;
#endif
	
