gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	if (lastval < 0) lastval = -lastval;
	if (nbRadioSnr ==  127) nbRadioSnr -= lastval;
	if (nbRadioSnr == -128) nbRadioSnr += lastval;
	
	return nbRadioSnr;
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioEARFCN(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioEARFCN				: 读取Nbiot RadioEARFCN值
 @Input				void
 @Return				RadioEARFCN
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioEARFCN(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.EARFCN;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.EARFCN;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.EARFCN;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.EARFCN;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioPCI(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioPCI				: 读取Nbiot RadioPCI值
 @Input				void
 @Return				RadioPCI
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioPCI(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.PCI;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.PCI;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.PCI;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.PCI;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioRSRQ(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioRSRQ				: 读取Nbiot RadioRSRQ值
 @Input				void
 @Return				RadioRSRQ
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioRSRQ(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.RSRQ;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.RSRQ;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.RSRQ;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.RSRQ;
#endif
}
#endif

#if NBIOT_ATCMD_GET_STATISTICSCELL
/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellEarfcn(void)
 @Description			TCFG_Utility_Get_Nbiot_CellEarfcn				: 读取Nbiot CellEarfcn值
 @Input				void
 @Return				CellEarfcn
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellEarfcn(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.earfcn;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.earfcn;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.earfcn;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.earfcn;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellPhysicalCellID(void)
 @Description			TCFG_Utility_Get_Nbiot_CellPhysicalCellID		: 读取Nbiot PhysicalCellCellID值
 @Input				void
 @Return				CellCellID
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellPhysicalCellID(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.physicalcellID;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.physicalcellID;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.physicalcellID;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.physicalcellID;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellPrimaryCell(void)
 @Description			TCFG_Utility_Get_Nbiot_CellPrimaryCell			: 读取Nbiot PrimaryCellCell值
 @Input				void
 @Return				CellCell
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellPrimaryCell(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.primarycell;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.primarycell;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.primarycell;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.primarycell;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellRsrp(void)
 @Description			TCFG_Utility_Get_Nbiot_CellRsrp				: 读取Nbiot CellRsrp值
 @Input				void
 @Return				CellRsrp
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellRsrp(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.rsrp;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.rsrp;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.rsrp;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.rsrp;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellRsrq(void)
 @Description			TCFG_Utility_Get_Nbiot_CellRsrq				: 读取Nbiot CellRsrq值
 @Input				void
 @Return				CellRsrq
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellRsrq(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.rsrq;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.rsrq;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.rsrq;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.rsrq;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellCellrssi(void)
 @Description			TCFG_Utility_Get_Nbiot_CellCellrssi			: 读取Nbiot CellCellrssi值
 @Input				void
 @Return				CellCellrssi
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellCellrssi(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.rssi;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.rssi;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.rssi;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.rssi;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellSnr(void)
 @Description			TCFG_Utility_Get_Nbiot_CellSnr				: 读取Nbiot CellSnr值
 @Input				void
 @Return				Nbiot_CellSnr
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellSnr(void)
{
	int nbRadioSnr = 0;
	
