gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
#if 0
#if NETPROTOCAL == NETCOAP
	nbRadioSnr = NbiotClientHandler.Parameter.statisticsCELL.snr >  127 ?  127 : NbiotClientHandler.Parameter.statisticsCELL.snr;
	nbRadioSnr = NbiotClientHandler.Parameter.statisticsCELL.snr < -127 ? -127 : NbiotClientHandler.Parameter.statisticsCELL.snr;
#elif NETPROTOCAL == NETMQTTSN
	nbRadioSnr = MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.snr >  127 ?  127 : MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.snr;
	nbRadioSnr = MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.snr < -127 ? -127 : MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.snr;
#elif NETPROTOCAL == NETONENET
	nbRadioSnr = OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr >  127 ?  127 : OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr;
	nbRadioSnr = OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr < -127 ? -127 : OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr;
#elif NETPROTOCAL == NETCTWING
	nbRadioSnr = CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr >  127 ?  127 : CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr;
	nbRadioSnr = CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr < -127 ? -127 : CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr;
#endif
#else
#if NETPROTOCAL == NETCOAP
	nbRadioSnr = NbiotClientHandler.Parameter.statisticsCELL.snr;
#elif NETPROTOCAL == NETMQTTSN
	nbRadioSnr = MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.snr;
#elif NETPROTOCAL == NETONENET
	nbRadioSnr = OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr;
#elif NETPROTOCAL == NETCTWING
	nbRadioSnr = CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr;
#endif
#endif
	
	return nbRadioSnr;
}
#endif

#if NBIOT_ATCMD_GET_AREACODE
/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_NetworkRegistStatusTac(void)
 @Description			TCFG_Utility_Get_Nbiot_NetworkRegistStatusTac	: 读取Nbiot NetworkRegistStatusTac值
 @Input				void
 @Return				Nbiot_NetworkRegistStatusTac
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_NetworkRegistStatusTac(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.networkRegStatus.tac;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.networkRegStatus.tac;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.networkRegStatus.tac;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.networkRegStatus.tac;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_NetworkRegistStatusCellID(void)
 @Description			TCFG_Utility_Get_Nbiot_NetworkRegistStatusCellID	: 读取Nbiot NetworkRegistStatusCellID值
 @Input				void
 @Return				Nbiot_NetworkRegistStatusCellID
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_NetworkRegistStatusCellID(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.networkRegStatus.cellID;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.networkRegStatus.cellID;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.networkRegStatus.cellID;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.networkRegStatus.cellID;
#endif
}
#endif

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_GetCoapConnectTime(void)
 @Description			TCFG_Utility_GetCoapConnectTime				: 读取Nbiot CoapConnectTime值
 @Input				void
 @Return				Nbiot_CoapConnectTime
**********************************************************************************************************/
unsigned int TCFG_Utility_GetCoapConnectTime(void)
{
	return NbiotClientHandler.CoapConnectTimeSec;
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_GetCoapIdleTime(void)
 @Description			TCFG_Utility_GetCoapIdleTime					: 读取Nbiot CoapIdleTime值
 @Input				void
 @Return				Nbiot_CoapIdleTime
**********************************************************************************************************/
unsigned int TCFG_Utility_GetCoapIdleTime(void)
{
	return NbiotClientHandler.CoapIdleTimeSec;
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersion(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersion	: 读取Nbiot PCPPlatformSoftVersion值
 @Input				void
 @Return				Nbiot_PCPPlatformSoftVersion
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersion(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)PCPClientHandler.Parameter.PlatformSoftVersion;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNPCPClientHandler.Parameter.PlatformSoftVersion;
#elif NETPROTOCAL == NETONENET
	return (char*)NULL;
#elif NETPROTOCAL == NETCTWING
	return (char*)NULL;
#endif
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersionMajor(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersionMajor	: 读取Nbiot PCPPlatformSoftVersionMajor值
 @Input				void
 @Return				Nbiot_PCPPlatformSoftVersionMajor
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersionMajor(void)
{
	unsigned int softMajor = 0;
	unsigned int softSub = 0;
	
#if NETPROTOCAL == NETCOAP
	sscanf((const char*)PCPClientHandler.Parameter.PlatformSoftVersion, "V%d.%d", &softMajor, &softSub);
#elif NETPROTOCAL == NETMQTTSN
	sscanf((const char*)MqttSNPCPClientHandler.Parameter.PlatformSoftVersion, "V%d.%d", &softMajor, &softSub);
#elif NETPROTOCAL == NETONENET
	softMajor = softMajor;
	softSub = softSub;
#elif NETPROTOCAL == NETCTWING
	softMajor = softMajor;
	softSub = softSub;
#endif
	
	return softMajor;
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersionSub(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersionSub		: 读取Nbiot PCPPlatformSoftVersionSub值
 @Input				void
 @Return				Nbiot_PCPPlatformSoftVersionSub
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersionSub(void)
{
	unsigned int softMajor = 0;
	unsigned int softSub = 0;
	
#if NETPROTOCAL == NETCOAP
	sscanf((const char*)PCPClientHandler.Parameter.PlatformSoftVersion, "V%d.%d", &softMajor, &softSub);
#elif NETPROTOCAL == NETMQTTSN
	sscanf((const char*)MqttSNPCPClientHandler.Parameter.PlatformSoftVersion, "V%d.%d", &softMajor, &softSub);
#elif NETPROTOCAL == NETONENET
	softMajor = softMajor;
	softSub = softSub;
#elif NETPROTOCAL == NETCTWING
	softMajor = softMajor;
	softSub = softSub;
#endif
	
	return softSub;
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceSize(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceSize	: 读取Nbiot PCPUpgradePackSliceSize值
 @Input				void
 @Return				Nbiot_PCPUpgradePackSliceSize
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceSize(void)
{
#if NETPROTOCAL == NETCOAP
	return PCPClientHandler.Parameter.UpgradePackSliceSize;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNPCPClientHandler.Parameter.UpgradePackSliceSize;
#elif NETPROTOCAL == NETONENET
	return 0;
#elif NETPROTOCAL == NETCTWING
	return 0;
#endif
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceNum(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceNum	: 读取Nbiot PCPUpgradePackSliceNum值
 @Input				void
 @Return				Nbiot_PCPUpgradePackSliceNum
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceNum(void)
{
#if NETPROTOCAL == NETCOAP
	return PCPClientHandler.Parameter.UpgradePackSliceNum;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNPCPClientHandler.Parameter.UpgradePackSliceNum;
#elif NETPROTOCAL == NETONENET
	return 0;
#elif NETPROTOCAL == NETCTWING
	return 0;
#endif
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceIndex(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceIndex	: 读取Nbiot PCPUpgradePackSliceIndex值
 @Input				void
 @Return				Nbiot_UpgradePackSliceIndex
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceIndex(void)
{
#if NETPROTOCAL == NETCOAP
	return PCPClientHandler.Parameter.UpgradePackSliceIndex;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNPCPClientHandler.Parameter.UpgradePackSliceIndex;
#elif NETPROTOCAL == NETONENET
	return 0;
#elif NETPROTOCAL == NETCTWING
	return 0;
#endif
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackCheckCode(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPUpgradePackCheckCode	: 读取Nbiot PCPUpgradePackCheckCode值
 @Input				void
 @Return				Nbiot_PCPUpgradePackCheckCode
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackCheckCode(void)
{
#if NETPROTOCAL == NETCOAP
	return PCPClientHandler.Parameter.UpgradePackCheckCode;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNPCPClientHandler.Parameter.UpgradePackCheckCode;
#elif NETPROTOCAL == NETONENET
	return 0;
#elif NETPROTOCAL == NETCTWING
	return 0;
#endif
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradeStartTimes(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPUpgradeStartTimes		: 读取Nbiot PCPUpgradeStartTimes值
 @Input				void
 @Return				Nbiot_PCPUpgradeStartTimes
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradeStartTimes(void)
{
#if NETPROTOCAL == NETCOAP
	return PCPClientHandler.Parameter.UpgradeStartTimes;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNPCPClientHandler.Parameter.UpgradeStartTimes;
#elif NETPROTOCAL == NETONENET
	return 0;
#elif NETPROTOCAL == NETCTWING
	return 0;
#endif
}

