gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
#if NBIOT_ATCMD_GET_MANUFACTURER
/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Manufacturer(void)
 @Description			TCFG_Utility_Get_Nbiot_Manufacturer			: 读取Nbiot Manufacturer值
 @Input				void
 @Return				Nbiot_Manufacturer
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Manufacturer(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.manufacturer;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.manufacturer;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.manufacturer;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.manufacturer;
#endif
}
#endif

#if NBIOT_ATCMD_GET_MANUFACTURERMODEL
/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Manufacturermode(void)
 @Description			TCFG_Utility_Get_Nbiot_Manufacturermode			: 读取Nbiot Manufacturermode值
 @Input				void
 @Return				Nbiot_Manufacturermode
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Manufacturermode(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.manufacturermode;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.manufacturermode;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.manufacturermode;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.manufacturermode;
#endif
}
#endif

#if NBIOT_ATCMD_GET_MODULEVERSION
/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_ModelVersion(void)
 @Description			TCFG_Utility_Get_Nbiot_ModelVersion			: 读取Nbiot ModelVersion值
 @Input				void
 @Return				Nbiot_ModelVersion
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_ModelVersion(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.modelversion;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.modelversion;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.modelversion;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.modelversion;
#endif
}
#endif

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_PDPType(void)
 @Description			TCFG_Utility_Get_Nbiot_PDPType				: 读取Nbiot PDPType值
 @Input				void
 @Return				Nbiot_PDPType
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_PDPType(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.cgdcontPDPType;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.cgdcontPDPType;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.cgdcontPDPType;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.cgdcontPDPType;
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_APN(void)
 @Description			TCFG_Utility_Get_Nbiot_APN					: 读取Nbiot APN值
 @Input				void
 @Return				Nbiot_APN
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_APN(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.cgdcontAPN;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.cgdcontAPN;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.cgdcontAPN;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.cgdcontAPN;
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_PDPContext_APN(void)
 @Description			TCFG_Utility_Get_Nbiot_PDPContext_APN			: 读取Nbiot PDPContext APN值
 @Input				void
 @Return				PDPContext_APN
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_PDPContext_APN(void)
{
#if NBIOT_MODULE_MODE_TYPE == NBIOT_MODULE_MODE_V120
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.cgdcontAPN;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.cgdcontAPN;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.cgdcontAPN;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.cgdcontAPN;
#endif
#endif
	
#if NBIOT_MODULE_MODE_TYPE == NBIOT_MODULE_MODE_V150
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.cgcontrdpAPN;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.cgcontrdpAPN;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.cgcontrdpAPN;
#elif NETPROTOCAL == NETCTWING
	return CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.cgcontrdpAPN;
#endif
#endif
}

#if NBIOT_ATCMD_GET_DNSSERVERADDRESS
/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_PrimaryDns(void)
 @Description			TCFG_Utility_Get_Nbiot_PrimaryDns				: 读取Nbiot PrimaryDns值
 @Input				void
 @Return				PrimaryDns
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_PrimaryDns(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)NbiotClientHandler.Parameter.qidnscfg.PrimaryDns;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNClientHandler.SocketStack->NBIotStack->Parameter.qidnscfg.PrimaryDns;
#elif NETPROTOCAL == NETONENET
	return (char*)OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.qidnscfg.PrimaryDns;
#elif NETPROTOCAL == NETCTWING
	return (char*)CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.qidnscfg.PrimaryDns;
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_SecondaryDns(void)
 @Description			TCFG_Utility_Get_Nbiot_SecondaryDns			: 读取Nbiot SecondaryDns值
 @Input				void
 @Return				SecondaryDns
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_SecondaryDns(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)NbiotClientHandler.Parameter.qidnscfg.SecondaryDns;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNClientHandler.SocketStack->NBIotStack->Parameter.qidnscfg.SecondaryDns;
#elif NETPROTOCAL == NETONENET
	return (char*)OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.qidnscfg.SecondaryDns;
#elif NETPROTOCAL == NETCTWING
	return (char*)CTWingClientHandler.LWM2MStack->NBIotStack->Parameter.qidnscfg.SecondaryDns;
#endif
}
#endif

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_SentCount(void)
 @Description			TCFG_Utility_Get_Nbiot_SentCount				: 读取Nbiot SentCount值
 @Input				void
 @Return				Nbiot_SentCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_SentCount(void)
{
	return TCFG_Utility_Get_NBIot_SentCount();
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RecvCount(void)
 @Description			TCFG_Utility_Get_Nbiot_RecvCount				: 读取Nbiot RecvCount值
 @Input				void
 @Return				Nbiot_RecvCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RecvCount(void)
{
	return TCFG_Utility_Get_NBIot_RecvCount();
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Device_Batt_ShortVal(void)
 @Description			TCFG_Utility_Get_Device_Batt_ShortVal			: 读取Device Batt值
 @Input				void
 @Return				Device_Batt
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Device_Batt_ShortVal(void)
{
	return VBAT_ADC_Read(1000);
}

/**********************************************************************************************************
 @Function			short TCFG_Utility_Get_Device_Temperature(void)
 @Description			TCFG_Utility_Get_Device_Temperature			: 读取Device Temperature值
 @Input				void
 @Return				Device_Temperature
**********************************************************************************************************/
short TCFG_Utility_Get_Device_Temperature(void)
{
	return TEMPERATURE_ADC_Read(1000);
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Build_Time_String(void)
 @Description			TCFG_Utility_Get_Build_Time_String				: 读取Build Time字符串
 @Input				void
 @Return				buildtime_string
**********************************************************************************************************/
char* TCFG_Utility_Get_Build_Time_String(void)
{
	char bulidData[12];
	
	memset(bulidData, 0x0, sizeof(bulidData));
	memset((void*)&TCFG_SystemData.BuildTime, 0, sizeof(TCFG_SystemData.BuildTime));
	
	memcpy(bulidData, __DATE__, 12);
	if (!memcmp(&bulidData[0], "Jan", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '1';
	}
	else	if (!memcmp(&bulidData[0], "Feb", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '2';
	}
	else if (!memcmp(&bulidData[0], "Mar", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '3';
	}
	else if(!memcmp(&bulidData[0], "Apr", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '4';
	}
	else if (!memcmp(&bulidData[0], "May", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '5';
	}
	else if (!memcmp(&bulidData[0], "Jun", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '6';
	}
	else if (!memcmp(&bulidData[0], "Jul", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '7';
	}
	else if (!memcmp(&bulidData[0], "Aug", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '8';
	}
	else if (!memcmp(&bulidData[0], "Sep", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '9';
	}
	else if (!memcmp(&bulidData[0], "Oct", 3)) {
		TCFG_SystemData.BuildTime[5] = '1';
		TCFG_SystemData.BuildTime[6] = '0';
	}
	else if (!memcmp(&bulidData[0], "Nov", 3)) {
		TCFG_SystemData.BuildTime[5] = '1';
		TCFG_SystemData.BuildTime[6] = '1';
	}
	else if (!memcmp(&bulidData[0], "Dec", 3)) {
		TCFG_SystemData.BuildTime[5] = '1';
		TCFG_SystemData.BuildTime[6] = '2';
	}
	
	memcpy(TCFG_SystemData.BuildTime, &bulidData[7], 4);
	memcpy(&TCFG_SystemData.BuildTime[8], &bulidData[4], 2);
	TCFG_SystemData.BuildTime[4] = '-';
	TCFG_SystemData.BuildTime[7] = '-';
  	TCFG_SystemData.BuildTime[11] = '\0';
	
